# Задача 34: Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку
# разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам
# стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число
# гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного
# слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг
# от друга пробелами. Стихотворение Винни-Пух вбивает в программу с клавиатуры. В ответе
# напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не
# в порядке
# Ввод: Вывод:
# пара-ра-рам рам-пам-папам па-ра-па-дам Парам пам-памdef count_vowels(word):
def count_vowels(word):
    vowels = 'aeiouy'
    return sum(1 for letter in word if letter.lower() in vowels)

def check_rhythm(poem):
    words = poem.split()
    syllables = [count_vowels(word) for word in words]
    return len(set(syllables)) == 1

poem = input()
if check_rhythm(poem):
    print('Парам пам-пам')
else:
    print('Пам парам')